In [34]:
import pandas as pd
import numpy as np
import os

In [35]:
dir=r'/home/sangam/Documents/task/students'

In [36]:
os.listdir(dir)

['reg-month1.csv',
 '.ipynb_checkpoints',
 'students.csv',
 'reg-month2.csv',
 'courses.csv',
 'merges.ipynb']

In [37]:
csv_files=[file for file in os.listdir(dir) if file.endswith('.csv')]
csv_files

['reg-month1.csv', 'students.csv', 'reg-month2.csv', 'courses.csv']

In [38]:
dataframes=[pd.read_csv(os.path.join(dir,file)) for file in csv_files]
courses=dataframes[3]
students=dataframes[1]
jan=dataframes[2]
feb=dataframes[0]

In [39]:
courses.columns

Index(['course_id', 'course_name', 'price'], dtype='object')

In [40]:
students.columns

Index(['student_id', 'name', 'partner'], dtype='object')

In [41]:
jan.columns

Index(['student_id', 'course_id'], dtype='object')

In [42]:
jan_temp=pd.merge(courses,jan,on="course_id",how="outer")
feb_temp=pd.merge(courses,feb,on="course_id",how="inner")

total_feb=feb_temp["price"].sum()
total_jan=jan_temp['price'].sum()
total=total_feb+total_jan
print("Total revenue :Rs",total)
print("Total revenu in jan is Rs",total_jan)
print("Total revenue in feb is Rs ",total_feb)

Total revenue :Rs 156245
Total revenu in jan is Rs 67070
Total revenue in feb is Rs  89175

In [50]:
jan

    student_id  course_id
0            3          5
1           16          7
2           12         10
3           12          1
4           14          9
5            7          7
6            7          2
7           16          3
8           17         10
9           11          8
10          14          6
11          12          5
12          12          7
13          18          8
14           1         10
15           1          9
16           2          5
17           7          6
18          22          5
19          22          6
20          23          9
21          23          5
22          14          4
23          14          1
24          11         10
25          42          9
26          50          8
27          38          1

In [49]:
courses

    course_id       course_name  price
0           1            python   2499
1           2               sql   3499
2           3     data analysis   4999
3           4  machine learning   9999
4           5           tableau   2499
5           6          power bi   1899
6           7          ms sxcel   1599
7           8            pandas   1099
8           9            plotly    699
9          10           pyspark   2499
10         11             Numpy    699
11         12               C++   1299

In [58]:
total=pd.concat([jan,feb])
total

    student_id  course_id
0            3          5
1           16          7
2           12         10
3           12          1
4           14          9
5            7          7
6            7          2
7           16          3
8           17         10
9           11          8
10          14          6
11          12          5
12          12          7
13          18          8
14           1         10
15           1          9
16           2          5
17           7          6
18          22          5
19          22          6
20          23          9
21          23          5
22          14          4
23          14          1
24          11         10
25          42          9
26          50          8
27          38          1
0           23          1
1           15          5
2           18          6
3           23          4
4           16          9
5           18          1
6            1          1
7            7          8
8           22          3
9           15          1
10          19          4
11           1          6
12           7         10
13          11          7
14          13          3
15          24          4
16          21          1
17          16          5
18          23          3
19          17          7
20          23          6
21          25          1
22          19          2
23          25         10
24           3          3

In [59]:
jan_t=pd.merge(total,courses,on="course_id",how="inner")

In [60]:
jan_t

    student_id  course_id       course_name  price
0            3          5           tableau   2499
1           16          7          ms sxcel   1599
2           12         10           pyspark   2499
3           12          1            python   2499
4           14          9            plotly    699
5            7          7          ms sxcel   1599
6            7          2               sql   3499
7           16          3     data analysis   4999
8           17         10           pyspark   2499
9           11          8            pandas   1099
10          14          6          power bi   1899
11          12          5           tableau   2499
12          12          7          ms sxcel   1599
13          18          8            pandas   1099
14           1         10           pyspark   2499
15           1          9            plotly    699
16           2          5           tableau   2499
17           7          6          power bi   1899
18          22          5           tableau   2499
19          22          6          power bi   1899
20          23          9            plotly    699
21          23          5           tableau   2499
22          14          4  machine learning   9999
23          14          1            python   2499
24          11         10           pyspark   2499
25          42          9            plotly    699
26          50          8            pandas   1099
27          38          1            python   2499
28          23          1            python   2499
29          15          5           tableau   2499
30          18          6          power bi   1899
31          23          4  machine learning   9999
32          16          9            plotly    699
33          18          1            python   2499
34           1          1            python   2499
35           7          8            pandas   1099
36          22          3     data analysis   4999
37          15          1            python   2499
38          19          4  machine learning   9999
39           1          6          power bi   1899
40           7         10           pyspark   2499
41          11          7          ms sxcel   1599
42          13          3     data analysis   4999
43          24          4  machine learning   9999
44          21          1            python   2499
45          16          5           tableau   2499
46          23          3     data analysis   4999
47          17          7          ms sxcel   1599
48          23          6          power bi   1899
49          25          1            python   2499
50          19          2               sql   3499
51          25         10           pyspark   2499
52           3          3     data analysis   4999

In [61]:
course_count=jan_t["course_name"].value_counts()

In [66]:
print("most demanding course is ",course_count.head(1))

most demanding course is  course_name
python    9
Name: count, dtype: int64

In [67]:
students

    student_id                name  partner
0            1       Kailash Harjo       23
1            2         Esha Butala        1
2            3      Parveen Bhalla        3
3            4         Marlo Dugal       14
4            5         Kusum Bahri        6
5            6  Lakshmi Contractor       10
6            7        Tarun Thaker        9
7            8      Radheshyam Dey        5
8            9   Nitika Chatterjee        4
9           10      Aayushman Sant        8
10          11  David Mukhopadhyay       20
11          12          Radha Dutt       19
12          13      Munni Varghese       24
13          14    Pranab Natarajan       22
14          15           Preet Sha       16
15          16        Elias Dodiya       25
16          17        Yasmin Palan        7
17          18     Fardeen Mahabir       13
18          19        Qabeel Raman       12
19          20       Hanuman Hegde       11
20          21          Seema Kota       15
21          22          Yash Sethi       21
22          23      Chhavi Lachman       18
23          24        Radhika Suri       17
24          25     Shashank D’Alia        2

In [82]:
# Find The Student who never enrolled in any course
temp1=pd.merge(students,total,on="student_id",how="left")

x=temp1[temp1["course_id"].isna()]
print(x["name"])

7            Marlo Dugal
8            Kusum Bahri
9     Lakshmi Contractor
15        Radheshyam Dey
16     Nitika Chatterjee
17        Aayushman Sant
43         Hanuman Hegde
Name: name, dtype: object

In [88]:
# Find The course that doees not enrolled by any student
temp2=courses.merge(total,on="course_id",how='left')
y=temp2[temp2["student_id"].isna()]
print("course that does not enrolled by any student ",y["course_name"])

course that does not enrolled by any student  53    Numpy
54      C++
Name: course_name, dtype: object

In [98]:
# find the Most loayal student ( highest enrolled person is most loay student)¶

total_df=total.merge(students,on="student_id",how="left")
total_df['name'].value_counts().head(1)

name
Chhavi Lachman    6
Name: count, dtype: int64

In [99]:
# Find The students who enrolled in both month (jan and feb )

In [104]:
total

    student_id  course_id
0            3          5
1           16          7
2           12         10
3           12          1
4           14          9
5            7          7
6            7          2
7           16          3
8           17         10
9           11          8
10          14          6
11          12          5
12          12          7
13          18          8
14           1         10
15           1          9
16           2          5
17           7          6
18          22          5
19          22          6
20          23          9
21          23          5
22          14          4
23          14          1
24          11         10
25          42          9
26          50          8
27          38          1
0           23          1
1           15          5
2           18          6
3           23          4
4           16          9
5           18          1
6            1          1
7            7          8
8           22          3
9           15          1
10          19          4
11           1          6
12           7         10
13          11          7
14          13          3
15          24          4
16          21          1
17          16          5
18          23          3
19          17          7
20          23          6
21          25          1
22          19          2
23          25         10
24           3          3

In [105]:
std_jan_feb=jan.merge(feb,on="student_id",how="inner")

In [113]:
std_jan_feb.merge(students,on='student_id',how="inner")['name'].unique()
print("student enrolled in both months are :",std_jan_feb.merge(students,on='student_id',how="inner")['name'].unique())

student enrolled in both months are : ['Parveen Bhalla' 'Elias Dodiya' 'Tarun Thaker' 'Yasmin Palan'
 'David Mukhopadhyay' 'Fardeen Mahabir' 'Kailash Harjo' 'Yash Sethi'
 'Chhavi Lachman']